Repository: n8rob/corpora
Catalog: french_haitian/archive/en-ht (1).tmx
Source language: en
Languages: ht

source: This is the two's place over here.
ht: Sa se kote de la sou isit la.

source: This is the one's place.
ht: Sa a se kote la yon.

source: If we add more digits... let me make it clear...
ht: Si nou ajoute plis chiffres... Se pou m' fè wè...

source: So in base two... let me write a number in base two... remember, in base two I can only use zeros and ones.
ht: Se konsa nan baz de... kite m' ekri yon foul moun nan baz de... pa bliye, nan baz de mwen kapab sèlman itilize zéros Et celles.

source: So, in base two, maybe I have the number 1010.
ht: Se konsa, nan baz de, petèt mwen gen anpil 1010.

source: So, when you think about it this way, if this was base ten you would call this the ten's place, the hundred's place, and the thousandth's place.
ht: Se konsa, lè nou panse osijè de sa Men ki jan, si sa a te dimil baz ou ta ka rele sa a dis a lieu, lieu la santèn a, Et place millième la.

source: But, this is base two now.
ht: Men, sa se baz de koulye a.

source: So let me be very clear.
ht: Se pou m' rete trè klè.

source: We are only using two digits.
ht: Nou ap itilize sèlman de chiffres.

source: So, in base two this right here is still the one's place now this is going to be the two's place remember, in base ten this was the ten's place, now this is the two's place.
ht: Se konsa, nan baz de isit-menm se toujou la wol Koulye a, sa ap en place de la pa bliye, nan baz dis sa a te genyen lieu dis a, koulye a sa se place de la.

source: Now this would be, and you can take a guess here hundreds was ten times ten.
ht: Koulye a sa se ta, Et ou ka fè yon deviner isit la dè santèn te dis fwa dis genyen.

source: When we go two spaces to the left in base two this should be the two times two's place.
ht: Lè n' ap mache de sou bò gòch nan de baz sa ta dwe la de fwa place de la.

source: Or this is the four's place.
ht: Ou, se sa rele kote a kat a.

source: This over here is going to be the eight's place.
ht: Sa sou isit la ap gen lieu a ywit a.

source: So, if you wanted to kind of think about this in terms of base two, this is one, one eight, plus zero fours, plus one twos, plus zero ones.
ht: Se konsa, si ou vle pou ti jan panse osijè de sa nan tèm de de baz, men se yon sèl, yon sèl ywit, plis zéro pat, plis de yon sèl, plis ceux zewo.

source: Plus zero ones.
ht: Plis zéro ceux.

source: So, if you wanted to represent this exact same number in base ten, it's one eight, plus one two.
ht: Konsa, si nou te vle pou nou repwezante sa a menm kantite nan baz dimil, se yonn ywit, plis yon sèl de.

source: So, in base ten this would be... let me write it over here... in base ten this would be an eight plus a two, which is just a ten
ht: Se konsa, nan baz dimil sa ta dwe... kite m' ekri l' sou isit la... nan dimil baz sa se ta yon uit plis de yon, ki se jis yon dizèn

source: So, this is in base ten.
ht: Se konsa, sa se nan baz dimil.

source: This is how you'd represent what we know as this many things - as ten things.
ht: Men ki jan ou ta ka repwezante sa nou konnen tankou sa a anpil bagay - kòm dis bagay.

source: This is how you'd represent it in base two.
ht: Se jan nou ta ka repwezante li nan de baz.

source: This is how we know we would represent it in base ten.
ht: Sa se jan nou konnen nou ta ka repwezante li nan baz dimil.

source: Now let's continue here, just to make sure we understand things.
ht: Koulye a Ann kontinye isit la, sèlman pou pi si nou konprann sa.

source: So, this many objects, well, in base two we have one... if you just have two objects - that's one two and zero ones... now three objects would be one two plus one ones.
ht: Se konsa, objets sa a anpil, men, nan baz de nou gen... Si ou gen sèlman de objets - sa se youn de Et zewo ceux... Koulye a, twa atik ki gen valè pwal fè yon sèl de plis yon sèl ceux.

source: So, let me do it over here, so this would be one two plus one ones.
ht: Se konsa, pou m' fè l' la sou isit la, se poutèt sa se ta yon de plis yon sèl chèf.

source: So, this is three objects in base two.
ht: Se konsa, sa se twa atik ki gen valè nan de baz.

source: Now when you go to this, so over here we have one four... zero twos and zero ones.
ht: Koulye a lè ou ale sa a, se konsa sou isit la nou gen youn nan kat... zéro de Et zéro ceux.

source: So, now we're going to go to the four place.
ht: Se konsa, koulye a nou pral pou ale nan kat kote yo.

source: Because we've essentially maxed out everything.
ht: Paske nou te gen maxed esansyèlman sou tout bagay.

source: If we increment more, we have to go to one more place just like we did in base ten, but now we can only use the digits zero and one.
ht: Si nou incrément plis, nou gen pou ale nan yon lòt kote egzateman tankou nou te fè nan baz dimil, men, koulye a nou kapab sèlman itilize les chiffres zewo, lòt la.

source: So, now we'll have one four, zero twos, zero ones.
ht: Se konsa, koulye a nou pwal genyen yon kat ti moun, zéro de, zéro ceux.

source: Now when we add one more, we're going to add one more one so, now we have one four, zero twos, and one one. and just to be clear, this is this many things.
ht: Koulye a lè nou ajoute yon lòt, nou pral ajoute yon lòt moun Se konsa, koulye a nou gen kat ti moun, zéro de, Et UN yonn. Et, tout en klè, sa se bagay sa a anpil.

source: This is this many things in base two, this is the four place one four and one one.
ht: Sa a se sa a anpil bagay nan de baz, se yon kat kote yon kat ak yon sèl moun.

source: If you wanted to convert this into base ten, you'd say look
ht: Si nou te vle pou kouvri sa nan baz dis, ou ta di gade

source: "this is one four, zero twos, and one one."
ht: "sa se youn kat ti moun, zéro de, Et UN yon."

source: So, if you have a four and a one, we would represent that with a symbol 5 in base ten, but we don't have that symbol to us in base two.
ht: Se konsa, si ou gen yon kat, yon lòt la, nou ta ka repwezante pou yon senbòl 5 nan baz dimil, men nou pa gen siy sa pou nou nan de baz.

source: Let's go to this.
ht: An n ale pou sa.

source: So, now we're going to increment one more.
ht: Se konsa, koulye a nou pral enkreman yon lòt.

source: So, how can we represent that in base two?
ht: Se konsa, ki kapab nou repwezante ki nan de baz?

source: This is definitely, we're going to have one four... and then we're going to have one two... and then we're going to have zero ones.
ht: Sa se san mank, nou pwal gen youn kat... epi lè sa a nou pwal gen youn de... Et puis nou pral mete zewo ceux.

source: And if you keep it... it's kind of fun counting in base two, you'll start to get the hang of it.
ht: Et si nou kenbe soit moke se ti jan de plaisir konte nan de baz, ou pral konmanse pou l fè a se sa.

source: So, here we'll have to add one one to this so we get one, one, one.
ht: Se konsa, isit la nou pwal genyen pou l ajoute yon yonn pou sa a konsa nou gen yon sèl, menm ki la, youn.

source: And now when we get to eight, there's no way to kind of increment any of these any higher, so we have to get a new place... we have to go to the eight's place.
ht: Et koulye a lè nou rive a ywit, pa gen anyen fason pou jan de incrément yonn nan tout sa yo moute pi wo, se poutèt sa, nou dwe genyen yon nou kote... nou gen pou ale nan Se konsa, nou gen yon sèl ywit... zéro pat, zéro de ak zéro ceux.

source: This right here, it might look like a thousand to you but it would be a thousand if we were in base ten.
ht: Sa a droit isit la, li te sanble mil (1.000) ou Men, li t' ap pote mil (1.000) si nou te nan baz dimil.

source: In base two, this is this many objects.
ht: Nan de baz, se sa a anpil atik ki gen valè.

source: This is eight objects in base two.
ht: Sa se wit atik ki gen valè nan de baz.

source: When you go... when you increment at one, we'll have this many, we'll have one eight, and then we'll have one one.
ht: Lè ou al... Lè ou incrément nan yon sèl, nou pwal gen pou m ' anpil, nou pwal genyen yon ywit, e lè sa a nou pwal gen youn yonn.

source: So, it'll be 1001.
ht: Se konsa, li ap fè 1001.

source: And then, I'll stop here, at what we consider to be ten objects.... in base two, you would say you have one eight, and you would need one two... so zero fours, one two, and zero ones.
ht: Apre sa, lè sa a, mwen ap rete isit la, nan sa nou konsidere pou dis atik ki gen valè... nan de baz, ou ta di ou gen yon sèl ywit, e ou ta bezwen yon de... Se konsa zewo pat, de, Et ceux zewo.

source: So, this right here is ten in base two.
ht: Se konsa, droit isit la se sa dis nan de baz yo.

source: This is ten in base ten.
ht: Sa se dis nan baz dimil.

source: Hopefully that doesn't confuse you too much.
ht: Ki pa twouble w twòp.

source: Jayda takes 3 hours to deliver 189 newspapers on her paper route.
ht: browser_id: fd7f63c11d4b34c8410ebb299d7be272ec042074 video_id: NZGK4jo7RqTK session_pk: 178235 [,,,,,,,,,,,,,,,,{"subtitle_id":"82252982669 browser_id: fd7f63c11d4b34c8410ebb299d7be272ec042074 video_id:

source: What is the rate per hour at which she delivers the newspaper?
ht: 178235 [,,,,,,,,,,,,,,,,{"subtitle_id":"82252982669

source: In this video I want to familiarize ourselves with negative numbers.
ht: Nan videyo sa a mwen vle familyarize tèt nou ak negatif anpil moun.

source: And also learn a bit of how do we add and subtract them.
ht: Et aprann tou yon ti kras sou kòmann yo fè nou ajoute Et retire yo.

source: And when you first encounter them, they look like this deep and mysterious thing.
ht: Lè ou fèk kontre yo, yo sanble nan gwo basen byen fon Et mistik bagay sa a.

source: When we first count things, we're counting positive numbers.
ht: Lè nou fèk konte bagay, nou ap konte moun pozitif.

source: What does a negative number even mean?
ht: Sa fè yon bann negatif menm mechan?

source: But when we think about it, you probably have encountered negative numbers in your everyday life.
ht: Men, lè nou panse osijè de sa, ou kapab byen ont rencontré numéros negatif nan lavi chak jou ou.

source: And let me just give you a few examples.
ht: Et, kite m' sèlman fè ou kèk egzanp.

source: So before I give the example, the general idea is a negative number is any number less than zero.
ht: Se konsa, anvan sa, m' ap moutre a, jeneral lide an se anpil negatif se yon nimewo mwens ke zewo.

source: Less than zero.
ht: Mwens ke zewo.

source: And if that sounds strange and abstract to you, let's just think about it in a couple of different contexts.
ht: Et si ki sanble lòt Et résumé pou nou la a, an n jis panse osijè de li nan yon koup diferan contextes.

source: If I have... if we're measuring the temperature ... (and it can be in Celsius or Farenheit, but let's just say we're measuring it in Celsius), and so let me draw a little scale that we can measure the temperature on.
ht: Si mwen gen... Si nou ap mezire tanperati a... (e li kapab nan Celsius ou Farenheit, Men, Ann èspere jis di nou ap mezire li nan Celsius),

source: So let's say that this is 0° Celsius, that is 1° Celsius, 2° Celsius, 3° Celsius.
ht: Se konsa nou di ke sa se 0° Celsius sa se 1° Celsius, 2° Celsius, 3° Celsius.

source: Now, let's say it's a pretty chilly day and it's currently 3° Celsius.
ht: Koulye a, an n di li se yon jou vrèman fè frèt Et, ki aktyèlman 3° Celsius.

source: And someone who predicts the future tells you that it is going to get 4° colder the next day.
ht: Ak yon moun ki te pwedi a tan kap vini di ou ke li pwal gen 4° plus jou kap vini a.

source: So how cold will it be?
ht: Se konsa jan frèt pral rive?

source: How can you represent that coldness?
ht: Ki jan ou kapab repwezante coldness sa?

source: Well, if it only got 1° colder it would be at 2°, but we know we have to go 4° colder.
ht: Men, si li apèn 1° plus li ta nan 2°, Men, nou konnen nou gen pou ale 4° plus.

source: If we got 2° colder, we would be at 1°.
ht: Si nou a 2° plus, nou ta gen nan 1°.

source: If we got 3° colder, we would be at 0°.
ht: Si nou a 3° plus, nou ta gen nan 0°.

source: But 3° isn't enough, we have to get 4° colder, so we actually have to go one more below zero.
ht: Men, 3° pa suffisante, nou dwe genyen 4° plus, Se konsa nou gen aktyèlman ale yon lòt anba zewo.

source: And that 1 below 0 we call that "negative 1".
ht: Et sa 1 pi ba pase 0 nou rele sa "1 negatif".

source: And so you can kind of see that the number line, as you go to the right of zero increases in positive values, as you go to the left of zero you're going to have -1, -2, -3.
ht: Se konsa, ou kapab ti jan wè sa liy nimewo menm jan ou fè bò dwat la zewo yo ogmante nan valè pozitif, menm jan ou al sou bò gòch la zewo ou pwal gen-1,-2,-3.

source: And you're going to have-depending on how you think about it- you're going to have larger negative numbers.
ht: Et, ou pral fè en fonction sou kijan ou panse osijè de li- ou pral fè gen pi gwo nimewo negatif.

source: But I want to make it very clear: -3 is LESS than -1.
ht: Men, mwen vle fè sa trè klè:-3, ki se MWENS ke-1.

source: There is less heat in the air at -3° than at -1°.
ht: Pa gen mwens chalè nan lè a nan-3 ° pase nan-1 °.

source: It is colder---there is less temperature there.
ht: Li plus---pa gen mwens tanperati.

source: So let me just make it very clear: -100 is much smaller than -1.
ht: Se pou m' sèlman fè li trè klè:-100 pi piti anpil pase-1.

source: You might look at 100 and you might look at 1 and your gut reaction might be that 100 is much larger than 1.
ht: Ou ka chèche nan 100 Et ou te ka gade nan 1 Et reyaksyon wo sak trip ou peut être 100 pi gwo pase 1.

source: But when you think about it,
ht: Men, lè ou panse osijè de sa,

source: -100 means there is a lack of something.
ht: -100 vle di pa gen yon mank de yon bagay.

source: -100: if it's -100° there is a lack of heat, so there is much less heat here than if we had -1°.
ht: -100: Si se-100 ° pa gen yon mank de solèy. Se konsa pa gen pi rèd chalè isit la pase si nou te gen-1 °.

source: Let me give you another example.
ht: Kite m ba ou yon lòt egzanp.

source: Let's say in my bank account today I have $10.
ht: An n di nan kont labank m' jòdi a mwen gen $10.

source: Now, let's say I go out there (because I feel good about my $10), and let's say I go and spend $30.
ht: Koulye a, an n di mwen ale la (paske m santi m byen osijè de m $10), Et, an n di mwen ale, pase $30.

source: And, for the sake of argument
ht: Et, for the sake of chire pit an n di mwen gen yon bank anpil likid

source: let's say I have a very flexible bank, one that lets me spend more money than I have (and these actually exist!).
ht: Lè sa a, yonn pou m ' depanse plis lajan mwen gen (Et sa yo aktyèlman ekziste!).

source: So I spend $30.
ht: Se konsa, mwen pase $30.

source: So what's my bank account going to look like?
ht: Se konsa m' kont anbank sak sanble?

source: So let me draw a number line here.
ht: Se pou m' trase yon liy nimewo isit la.

source: And you may already have an intuitive response:
ht: Apre sa, nou ka deja gen yon repons intuitive:

source: I will owe the bank some money.
ht: Mwen pral dwe bank la yon lajan.

source: Tomorrow, what is my bank account?
ht: Denmen, ki sa ki kont labank m?

source: You might immediately say, "if I have $10 and I spend $30, there's $20 that had to come from some place."
ht: Nou te imedyatman di: "si m gen $10 Et mwen pase $30, pa gen $20 sa yo te gen pou leve soti yon kote."

source: And that $20 is coming from the bank.
ht: Et sa $20 ap soti nan bank lan.

source: So I'm going to owe the bank $20.
ht: Se konsa mwen pral dwe $20, bank lan.

source: And so, in my bank account, to show how much I have, I could say $10 - $30 is -$20.
ht: Poutèt sa, m' kont anbank, nan pou montre konbyen m, mwen te kapab di $10 - $30-$20.

source: So in my bank account tomorrow, I'm going to have -$20.
ht: Se konsa nan kont bank mwen denmen, mwen pral gen-$20.

source: So, if I say I have -$20, that means that I owe the bank.
ht: Se konsa, si mwen di: mwen gen-$20, sa vle di mwen dwe bank lan.

source: ---I don't even have it.
ht: ---Mwen pa bezwen sa.

source: Not only do I have nothing, I owe something.
ht: Se pa sa sèlman, èske mwen pa gen anyen, mwen pa dwe yon bagay.

source: It's going in reverse.
ht: Li pwal nan inverse.

source: Here, I have something to spend... if my $10 in my bank account means the bank owes me $10.
ht: Isit la, mwen gen yon bagay ase... Si m $10 nan kont labank m' vle di nan bank lan fè prete m $10.

source: I have $10 that I can use to go spend.
ht: M fè $10 sa mwen ka itilize pou ale pase. / kè m boule m.

source: Now, all of a sudden I owe the bank.
ht: Koulye a, tout de yon soudaine mwen dwe bank lan.

source: I've gone the other direction.
ht: Mwen te al lòt bò.

source: If we use a number line here it should hopefully make more sense.
ht: Si nou itilize yon liy nimewo isit la li ta dwe fè, plis konprann.

source: So that is 0.
ht: Se poutèt sa se 0.

source: I'm starting off with $10, and spending $30 means I'm moving 30 spaces to the left.
ht: M ap konmanse ak $10, Et depans $30 vle di m ap fè mache 30 sou bò gòch.

source: So if I move 10 spaces to the left--- if I only spend $10 I'll be back at $0.
ht: Si mwen jwe 10 mache sou bò gòch--- Si mwen sèlman pase $10 m ap tounen nan $0.

source: If I spend another $10, I'll be at -$10.
ht: Si mwen pase yon lòt $10, m' ap fè nan-$10.

source: If I spend another $10 after that, I will be at -$20.
ht: Si mwen pase yon lòt $10 Apre sa, m' ap nan-$20.

source: So, each of these distances, I spent $10 I'd be at $0.
ht: Se konsa, chak de distans sa yo, m' ap pase $10 mwen ki pwal nan $0.

source: Another $10 I'd be at -$10.
ht: Yon lòt $10 mwen ki pwal nan-$10.

source: Another $10 I would be at -$20.
ht: Yon lòt $10 mwen ki pwal nan-$20.

source: So this whole distance here is how much I spent.
ht: Se poutèt sa a an antye distans isit la se konbyen mwen te pase.

source: I spent $30.
ht: Mwen te pase $30.

source: So the general idea when you spend or if you subtract, or getting colder, you would move to the left.
ht: Se konsa lide jeneral an lè ou pase, ou si ou retire, ou obtenir plus, ou ta deplase pou sou bò gòch.

source: The numbers would get smaller.
ht: Anpil moun la ta gen pi piti.

source: And we now know they can get even smaller than 0.
ht: E nou konnen koulye a yo ka jwenn menm pi piti 0.

source: They can go to -1, -2---they can even go to -1.5, -1.6.
ht: Yo kapab ale pou-1,-2---yo ka menm al pou-1.5,-1.6.

source: The more and more negative, the more you lose.
ht: La pi byen toujou negatif, plis ou pèdi.

source: If you're adding, if I go and get my paycheck,
ht: Si ou gen ajout, si mwen ale, pran m' lajan taks sou chèk

source: I will move to the right of the number line.
ht: Mwen pral fè mouvman pou dwa liy nimewo a.

source: Now, with that out of the way, let's just do a couple more pure math problems.
ht: Koulye a, ak pye, sa an n jis fè kèk plis nan matematik pwoblèm.

source: What it means, if we were to say...
ht: Kisa sa vle di, si nou te gen pou di...

source: Let's say, 3 - 4.
ht: An n pale, 3-4.

source: So once again, this is exactly the situation we did with the temperature.
ht: Se konsa yon fwa ankò, sa se exactement sitiyasyon nou te fè ak tanperati a.

source: We're starting with 3 and we're subtracting 4, so we're going to move 4 to the left.
ht: Nou ap konmanse ak 3 Et nou ap soustrayant 4, Se poutèt sa, nou pral pou yo avanse 4 sou bò gòch.

source: We go 1, 2, 3, 4.
ht: Nou ale 1, 2, 3, 4.

source: That gets us to -1.
ht: Ki jwenn nou pou-1.

source: And when you're starting to do this you really understand what a negative number means.
ht: Lè ou konmanse fè sa ou vrèman konprann ki yon negatif nimewo mwayen.

source: I really encourage you to visualize the number line and really move along it depending on whether you're adding or subtracting.
ht: Mwen reyèlman ankouraje w visualiser liy nimewo a Et vrèman deplase nan men l' sou en èske ou gen ajout ou soustrayant.

source: Let's do a couple more.
ht: An n fè kèk ankò.

source: Let's say I have 2 - 8 (and we'll think about more ways to do this in future videos), but once again, you just want to do the number line.
ht: An n di mwen gen 2-8 (e nou ap panse osijè de lòt fason pou fè sa a nan pwochen vidéos), Men, yon fwa ankò, ou jis vle fè liy nimewo a.

source: You have a 0 here.
ht: Ou gen yon 0 isit la.

source: We're at (let me draw the spacing a little bit).
ht: Nan (kite m' trase espacement a yon ti kras).

source: We have 0 here...we're at 1... 2.
ht: Nou gen 0 isit la... nan 1... 2.

source: If we're subtracting 8, that means we're going to move 8 to the left.
ht: Si nou gen soustrayant 8, sa vle di nou pwal pou yo avanse 8 sou bò gòch.

source: So we're going to go 1 to the left, 2 to the left.
ht: Se konsa nou pral fè bò gòch, 2 sou bò gòch 1.

source: So, we've gone 2 to the left to get to 0.
ht: Se konsa, nou te ale 2 sou bò gòch pou ale 0.

source: We have to move how many more to the left?
ht: Nou gen pou yo avanse ki kantite ankò sou bò gòch?

source: We've already moved 2 to the left, to get to 8, we have to move 6 more to the left.
ht: Nou deja te deplase 2 sou bò gòch, pou jwenn pou 8, nou gen pou yo avanse 6 plis sou bò gòch.

source: So we're going to have to move 1-2-3-4-5-6 more to the left.
ht: Se konsa nou pral gen pou yo avanse 1-2-3-4-5-6 ankò sou bò gòch.

source: Well, where is that going to put us?
ht: Men, kote sa pwal fè nou?

source: Well, we were at 0.
ht: Men, nou te nan 0.

source: This is -1, -2, -3, -4, -5, -6.
ht: Sa se-1,-2,-3,-4,-5,-6.

source: So, 2 - 8 is -6.
ht: Se konsa, 2-8 se-6.

source: 2-2 would be 0.
ht: 2-2 ki ta 0.

source: When you're subtracting 8 you're subtracting another 6.
ht: Lè w ap soustrayant 8 ou ap soustrayant 6 yon lòt.

source: So we go to -6, we go 6 below 0.
ht: Se konsa nou ale nan-6, nou pase 6 pi ba pase 0.

source: Let me do one more example.
ht: Pou m' fè youn nan ekzanp plis.

source: (and this will be a little less conventional but hopefully it will make sense).
ht: (Et sa a pral yon ti kras mwens classiques Men, li pral fè sans).

source: Let us take... (and I'll do this in a new color)...
ht: Ann pran... (e mwen pwal fè sa nan yon nouvo koulè)...

source: Let me take -4 - 2.
ht: Kite m' wete-4-2.

source: So we're starting at a negative number and then we're subtracting from that.
ht: Se konsa nou ap kòmanse nan anpil negatif Apre sa, lè sa a nou ap soustrayant pou sa.

source: Now, if this seems confusing just remember the number line!
ht: Koulye a, si sa semble ki pa klè jis sonje liy nimewo a!

source: So this is 0 right here.
ht: Se poutèt sa se isit-0.

source: This is -1, -2, -3, -4.
ht: Sa se-1,-2,-3,-4.

source: So that's where we're starting.
ht: Se konsa, sa se kote nou ap kòmanse.

source: Now we're going to subtract 2 from -4, so we're going to move 2 to the left.
ht: Kounye a nou pwal retire 2 de-4, Se poutèt sa, nou pral pou yo avanse 2 sou bò gòch.

source: So if we subtract 1 we'll be at -5.
ht: Se konsa, si nou retire 1 nou ap fè nan-5.

source: If we subtract another 1 we are going to be at -6.
ht: Si nou retire yon lòt 1 nou pwal gen nan-6.

source: So this is -6.
ht: Se poutèt sa se-6.

source: Let's do another interesting thing.
ht: An n fè yon lòt bagay enteresan.

source: Let's start at -3 ... let's say we have -3.
ht: An n kòmanse nan-3... Ann di nou gen-3.

source: Instead of subtracting something from that, let's add 2.
ht: Olye ke yo soustrayant yon bagay sòti de sa, an n ajoute 2.

source: So where would this put us on the number line?
ht: Se konsa kote ta sa a mete nou sou liy nimewo a?

source: So we're starting at -3 and we're adding 2.
ht: Se konsa nou ap kòmanse nan-3 e nou ap ajout 2.

source: So we're going to move to the right.
ht: Se konsa nou pwal deplase pou dwa.

source: So you add 1, you become -2
ht: Se konsa, ou ajoute 1, ou vin-2

source: But if you add another 1 (which we have to do), you become -1.
ht: Men, si ou ajoute yon lòt 1 (sa nou dwe fè), ou vin-1.
